belak/zsh-utils path:prompt
ohmyzsh/ohmyzsh path:plugins/starship


# custom plugins
$ZDOTDIR/plugins/ssh-autoload
$ZDOTDIR/plugins/dotnet kind:defer
$ZDOTDIR/plugins/fzf
$ZDOTDIR/plugins/zoxide 

# plugins
fdellwing/zsh-bat kind:defer
mattmc3/zman kind:defer # fzf on man pages
reegnz/jq-zsh-plugin kind:defer # use jq with fzf (ALT + J)


# ohmyzsh plugins
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/ripgrep kind:fpath
ohmyzsh/ohmyzsh path:plugins/fd kind:fpath
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/colored-man-pages


# zsh-utils
belak/zsh-utils path:editor
belak/zsh-utils path:utility
belak/zsh-utils path:history




jirutka/zsh-shift-select

# completions
clarketm/zsh-completions kind:fpath

# add completions
belak/zsh-utils path:completion

# use fzf to complete commands
Aloxaf/fzf-tab
Freed-Wu/fzf-tab-source
wfxr/forgit kind:defer
wfxr/forgit path:completions kind:fpath


# defered plugins
zdharma-continuum/fast-syntax-highlighting kind:defer
unixorn/bitbucket-git-helpers.plugin.zsh kind:defer


# aliases
$ZDOTDIR/.aliases

# always at the end
zsh-users/zsh-history-substring-search kind:defer
zsh-users/zsh-autosuggestions kind:defer

